/* ====================================================
#   Copyright (C)2019 All rights reserved.
#
#   Author        : domchan
#   Email         : 814172254@qq.com
#   File Name     : config.go
#   Created       : 2019/1/7 14:32
#   Last Modified : 2019/1/7 14:32
#   Describe      :
#
# ====================================================*/
package cst

const (
	WeiXinAccessToken = "weixin_access_token"
)

var (
	ErrCodeValue = map[int]string{
		106001001: "时间格式错误",
		106001002: "此消息已发送,无法修改",
		106001003: "请求平台不存在",
		106001004: "消息内容为空",
		106001005: "查询id为空",
		106001006: "此消息已取消发送,请勿重复操作",
		106001007: "消息类型不存在",
		106001008: "模板编号错误",
		106001009: "模板参数错误",
		106001010: "消息内容和模板不一致",
		106001011: "短信服务商不存在",
		106001012: "平台key内容为空",
		106001013: "查询页数不合法或超过范围",
		106001014: "1分钟内短信发送数量到达上限",
		106001015: "1小时内短信发送数量到达上限",
		106001016: "24小时内短信发送数量到达上限",
	}
	ErrCodeKey = map[string]int{
		"时间格式错误":          106001001,
		"此消息已发送,无法修改":     106001002,
		"请求平台不存在":         106001003,
		"消息内容为空":          106001004,
		"查询id为空":          106001005,
		"此消息已取消发送,请勿重复操作": 106001006,
		"消息类型不存在":         106001007,
		"模板编号错误":          106001008,
		"模板参数错误":          106001009,
		"消息内容和模板不一致":      106001010,
		"短信服务商不存在":        106001011,
		"平台key内容为空":       106001012,
		"查询页数不合法或超过范围":    106001013,
		"1分钟内短信发送数量到达上限":  106001014,
		"1小时内短信发送数量到达上限":  106001015,
		"24小时内短信发送数量到达上限": 106001016,
	}
)
